#include<stdio.h>
int main()
{
	float  r1 = 0.015, r2 = 0.021, r3 = 0.0275, r5 = 0.03, r0 = 0.035, P;
	int i = 1;
	P = 1000 * (1 + 5 * r5);
	printf("一次存5年期的本息和:%f\n", P);//(1)
	P = 1000 * (1 + 2 * r2);
	P = P * (1 + 3 * r3);
	printf("先存2年期，到期后将本息再存3年期的本息和:%f\n", P);  //(2)
	P = 1000 * (1 + 3 * r3);
	P = P * (1 + 2 * r2);
	printf("先存3年期，到期后将本息再存2年期的本息和:%f\n", P);  //(3)
	for (P = 1000; i <= 5; i++)
	{
		P = P * (1 + r1);
	}
	printf("先存1年期，到期后将本息再存1年期,连续存5次的本息和:%f\n", P);  //(4)
	i = 1;
	for (P = 1000; i <= 20; i++)
	{
		P = P * (1 + r0 / 4);
	}
	printf("存活期存款。活期利息每一季度结算一次的本息和:%f\n", P);  //(5)
	return 0;
}